<?php
return [
    'add'                       => 'เพิ่มผู้ใช้',
    'dashboard'                 => 'Dashboard',
	'edit'                       => 'จัดการผู้ใช้ และ สมาชิก',
    'loginFailed'                       => 'ชื่อหรือผู้ใช้ผิดผลาด',

    'edit'                       => 'จัดการผู้ใช้ และ สมาชิก',
    'edit'                       => 'จัดการผู้ใช้ และ สมาชิก',
    'edit'                       => 'จัดการผู้ใช้ และ สมาชิก',
    'edit'                       => 'จัดการผู้ใช้ และ สมาชิก',
    'edit'                       => 'จัดการผู้ใช้ และ สมาชิก',
    'edit'                       => 'จัดการผู้ใช้ และ สมาชิก',
    'edit'                       => 'จัดการผู้ใช้ และ สมาชิก',
    'edit'                       => 'จัดการผู้ใช้ และ สมาชิก',


];