<?php

return array(
    'save'    => 'บันทึก',
    'undo'    => 'ย้อนกลับ',
    'show'    => 'แสดง',
    'modify'  => 'แก้ไข',
    'delete'  => 'ลบ',
    'add'     => 'เพิ่ม',
    'reset'   => 'ล้าง',
    'search'  => 'ค้นหา',
    'back'    => 'Back',

    //dataedit
    'inserted'   => 'เพิ่มรายการใหม่สำเร็จ.',
    'updated'    => 'อัพเดทรายการสำเร็จ.',
    'deleted'    => 'ลบรายการสำเร็จ.',
    'err'        => 'เกิดข้อผิดผลาด.',
    'err_unknown'=> 'เกิดข้อผิดผลาด, ไม่มีรายการที่เลือก',
    'err_dup_pk' => 'เกิดข้อผิดผลาด, รหัสซ้ำ',
    'conf_delete'=> 'คุณต้องการลบจริงหรือไม่?',

);
